app/controllers/novels_controller.rb

  def index
    @novels = Novel.all
---
SELECT "novels".* FROM "novels"

  def create
    @novel = Novel.new(novel_params)
    if @novel.save
---
INSERT INTO "novels" ("title", "author", "blog", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @novel.update(novel_params)
---
UPDATE "novels" SET "title" = $1, "author" = $2, "blog" = $3, "updated_at" = $4 WHERE "novels"."id" = $5  [["title", "awdwas snnsnsd"], ["author", "awwdndndnnaraw"], ["blog", "efd ddnndndnnd ndneafouef"], ["updated_at", "2023-09-21 19:42:00.460576"], ["id", 6]]

  def destroy
    if @novel.destroy
---
DELETE FROM "novels" WHERE "novels"."id" = $1  [["id", 1]]

  def set_novel
    @novel = Novel.find(params[:id])
---
SELECT "novels".* FROM "novels" WHERE "novels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]